duxinglang-1/nRF9160_test/E2_TEST/src/screen/screen.c
	switch(global_settings.time_format)
	{
	case TIME_FORMAT_24:
		if(flag)
			sprintf((char*)str_time, "%02d:%02d", date_time.hour, date_time.minute);
		else
			sprintf((char*)str_time, "%02d %02d", date_time.hour, date_time.minute);
		break;

	case TIME_FORMAT_12:
		if(flag)
			sprintf((char*)str_time, "%02d:%02d", (date_time.hour>12 ? (date_time.hour-12):date_time.hour), date_time.minute);
		else
			sprintf((char*)str_time, "%02d %02d", (date_time.hour>12 ? (date_time.hour-12):date_time.hour), date_time.minute);
		break;
	}
	flag = !flag;
	
	LCD_MeasureString(str_time,&w,&h);
	x = (LCD_WIDTH > w) ? (LCD_WIDTH-w)/2 : 0;
	y = IDLE_TIME_Y;
	LCD_ShowString(x,y,str_time);
}

void IdleShowSystemWeek(void)
{
	u16_t x,y,w,h;
	u8_t str_week[128] = {0};

	POINT_COLOR=WHITE;
	BACK_COLOR=BLACK;

#ifdef FONT_32
	LCD_SetFontSize(FONT_SIZE_32);
#elif defined(FONT_24)
	LCD_SetFontSize(FONT_SIZE_24);
#else
	LCD_SetFontSize(FONT_SIZE_16);
#endif

	GetSystemWeekStrings(str_week);
	LCD_MeasureString(str_week,&w,&h);
	x = IDLE_WEEK_X;
	y = IDLE_WEEK_Y;
	LCD_ShowString(x,y,str_week); 
}

void IdleShowDateTime(void)
{
	IdleShowSystemTime();
	IdleShowSystemDate();
	IdleShowSystemWeek();
}

void IdleUpdateBatSoc(void)
{
	static bool flag = true;
	u16_t w,h;
	u8_t strbuf[128] = {0};

	LCD_FillColor(IDLE_BAT_PERCENT_X, IDLE_BAT_PERCENT_Y, IDLE_BAT_PERCENT_W, IDLE_BAT_PERCENT_H, BLACK);

	LCD_SetFontSize(FONT_SIZE_16);
	sprintf(strbuf, "%02d%%", g_bat_soc);
	LCD_MeasureString(strbuf, &w, &h);
	LCD_ShowString((IDLE_BAT_X-w)-2, IDLE_BAT_PERCENT_Y, strbuf);

	if(charger_is_connected && (g_chg_status == BAT_CHARGING_PROGRESS))
	{
		if(flag)
		{
			flag = false;
			LCD_ShowImg_From_Flash(IDLE_BAT_X, IDLE_BAT_Y, IMG_BAT_RECT_WHITE_ADDR);
		}
		
		bat_charging_index++;
		if(bat_charging_index > 10)
		 bat_charging_index = 0;

		if(bat_charging_index == 0)
			LCD_Fill(IDLE_BAT_INNER_RECT_X, IDLE_BAT_INNER_RECT_Y, IDLE_BAT_INNER_RECT_W, IDLE_BAT_INNER_RECT_H, BLACK);
		else
			LCD_Fill(IDLE_BAT_INNER_RECT_X, IDLE_BAT_INNER_RECT_Y, (bat_charging_index*IDLE_BAT_INNER_RECT_W)/10, IDLE_BAT_INNER_RECT_H, GREEN);
	}
	else
	{
		flag = true;
		bat_charging_index = g_bat_soc/10;
		
		if(g_bat_soc >= 20)
		{
			LCD_ShowImg_From_Flash(IDLE_BAT_X, IDLE_BAT_Y, IMG_BAT_RECT_WHITE_ADDR);
			LCD_Fill(IDLE_BAT_INNER_RECT_X, IDLE_BAT_INNER_RECT_Y, (g_bat_soc*IDLE_BAT_INNER_RECT_W)/100, IDLE_BAT_INNER_RECT_H, GREEN);
		}
		else
		{
			LCD_ShowImg_From_Flash(IDLE_BAT_X, IDLE_BAT_Y, IMG_BAT_RECT_RED_ADDR);
			LCD_Fill(IDLE_BAT_INNER_RECT_X, IDLE_BAT_INNER_RECT_Y, (g_bat_soc*IDLE_BAT_INNER_RECT_W)/100, IDLE_BAT_INNER_RECT_H, RED);
		}
	}
}

void IdleShowBatSoc(void)
{
	u16_t w,h;
	u8_t strbuf[128] = {0};

	LCD_SetFontSize(FONT_SIZE_16);
	sprintf(strbuf, "%02d%%", g_bat_soc);
	LCD_MeasureString(strbuf, &w, &h);
	LCD_ShowString((IDLE_BAT_X-w)-2, IDLE_BAT_PERCENT_Y, strbuf);

	bat_charging_index = g_bat_soc/10;
	
	if(charger_is_connected && (g_chg_status == BAT_CHARGING_PROGRESS))
	{
		LCD_ShowImg_From_Flash(IDLE_BAT_X, IDLE_BAT_Y, IMG_BAT_RECT_WHITE_ADDR);
		LCD_Fill(IDLE_BAT_INNER_RECT_X, IDLE_BAT_INNER_RECT_Y, (g_bat_soc*IDLE_BAT_INNER_RECT_W)/100, IDLE_BAT_INNER_RECT_H, GREEN);
	}
	else
	{
		if(g_bat_soc >= 20)
		{
			LCD_ShowImg_From_Flash(IDLE_BAT_X, IDLE_BAT_Y, IMG_BAT_RECT_WHITE_ADDR);
			LCD_Fill(IDLE_BAT_INNER_RECT_X, IDLE_BAT_INNER_RECT_Y, (g_bat_soc*IDLE_BAT_INNER_RECT_W)/100, IDLE_BAT_INNER_RECT_H, GREEN);
		}
		else
		{
			LCD_ShowImg_From_Flash(IDLE_BAT_X, IDLE_BAT_Y, IMG_BAT_RECT_RED_ADDR);
			LCD_Fill(IDLE_BAT_INNER_RECT_X, IDLE_BAT_INNER_RECT_Y, (g_bat_soc*IDLE_BAT_INNER_RECT_W)/100, IDLE_BAT_INNER_RECT_H, RED);
		}
	}
}

void IdleShowSignal(void)
{
	u32_t img_add[5] = {IMG_SIG_0_ADDR, IMG_SIG_1_ADDR, IMG_SIG_2_ADDR, IMG_SIG_3_ADDR, IMG_SIG_4_ADDR};

	LCD_ShowImg_From_Flash(IDLE_SIGNAL_X, IDLE_SIGNAL_Y, img_add[g_nb_sig]);
}

#ifdef CONFIG_IMU_SUPPORT
void IdleUpdateSportData(void)
{
	u32_t img_addr[10] = {
							IMG_IDLE_STEP_NUM_0_ADDR,
							IMG_IDLE_STEP_NUM_1_ADDR,
							IMG_IDLE_STEP_NUM_2_ADDR,
							IMG_IDLE_STEP_NUM_3_ADDR,
							IMG_IDLE_STEP_NUM_4_ADDR,
							IMG_IDLE_STEP_NUM_5_ADDR,
							IMG_IDLE_STEP_NUM_6_ADDR,
							IMG_IDLE_STEP_NUM_7_ADDR,
							IMG_IDLE_STEP_NUM_8_ADDR,
							IMG_IDLE_STEP_NUM_9_ADDR
						 };

	LCD_ShowImg_From_Flash(IDLE_STEPS_BG_X, IDLE_STEPS_BG_Y, IMG_IDLE_STEP_LOGO_ADDR);
	LCD_ShowImg_From_Flash(IDLE_STEPS_NUM_X+0*IDLE_STEPS_NUM_W, IDLE_STEPS_NUM_Y, img_addr[g_steps/10000]);
	LCD_ShowImg_From_Flash(IDLE_STEPS_NUM_X+1*IDLE_STEPS_NUM_W, IDLE_STEPS_NUM_Y, img_addr[(g_steps%10000)/1000]);
	LCD_ShowImg_From_Flash(IDLE_STEPS_NUM_X+2*IDLE_STEPS_NUM_W, IDLE_STEPS_NUM_Y, img_addr[(g_steps%1000)/100]);
	LCD_ShowImg_From_Flash(IDLE_STEPS_NUM_X+3*IDLE_STEPS_NUM_W, IDLE_STEPS_NUM_Y, img_addr[(g_steps%100)/10]);
	LCD_ShowImg_From_Flash(IDLE_STEPS_NUM_X+4*IDLE_STEPS_NUM_W, IDLE_STEPS_NUM_Y, img_addr[g_steps%10]);
}

void IdleShowSportData(void)
{
	u32_t img_addr[10] = {
							IMG_IDLE_STEP_NUM_0_ADDR,
							IMG_IDLE_STEP_NUM_1_ADDR,
							IMG_IDLE_STEP_NUM_2_ADDR,
							IMG_IDLE_STEP_NUM_3_ADDR,
							IMG_IDLE_STEP_NUM_4_ADDR,
							IMG_IDLE_STEP_NUM_5_ADDR,
							IMG_IDLE_STEP_NUM_6_ADDR,
							IMG_IDLE_STEP_NUM_7_ADDR,
							IMG_IDLE_STEP_NUM_8_ADDR,
							IMG_IDLE_STEP_NUM_9_ADDR
						 };

	LCD_ShowImg_From_Flash(IDLE_STEPS_BG_X, IDLE_STEPS_BG_Y, IMG_IDLE_STEP_LOGO_ADDR);
	LCD_ShowImg_From_Flash(IDLE_STEPS_NUM_X+0*IDLE_STEPS_NUM_W, IDLE_STEPS_NUM_Y, img_addr[g_steps/10000]);
	LCD_ShowImg_From_Flash(IDLE_STEPS_NUM_X+1*IDLE_STEPS_NUM_W, IDLE_STEPS_NUM_Y, img_addr[(g_steps%10000)/1000]);
	LCD_ShowImg_From_Flash(IDLE_STEPS_NUM_X+2*IDLE_STEPS_NUM_W, IDLE_STEPS_NUM_Y, img_addr[(g_steps%1000)/100]);
	LCD_ShowImg_From_Flash(IDLE_STEPS_NUM_X+3*IDLE_STEPS_NUM_W, IDLE_STEPS_NUM_Y, img_addr[(g_steps%100)/10]);
	LCD_ShowImg_From_Flash(IDLE_STEPS_NUM_X+4*IDLE_STEPS_NUM_W, IDLE_STEPS_NUM_Y, img_addr[g_steps%10]);
}
#endif

void IdleUpdateHealthData(void)
{
	u16_t x,y,w,h;
	u8_t strbuf[128] = {0};
	u8_t tmpbuf[128] = {0};
	
	LCD_SetFontSize(FONT_SIZE_16);

#ifdef FONTMAKER_UNICODE_FONT
	mmi_asc_to_ucs2(tmpbuf,"HR:");
	LCD_MeasureUniString(tmpbuf, &w, &h);		
	LCD_Fill(PPG_DATA_SHOW_X+w, PPG_DATA_SHOW_Y, 50, PPG_DATA_SHOW_H, BLACK);
	sprintf(strbuf, "%d", g_hr);
	mmi_asc_to_ucs2(tmpbuf,strbuf);
	LCD_ShowUniString(PPG_DATA_SHOW_X+w, PPG_DATA_SHOW_Y, tmpbuf);

	mmi_asc_to_ucs2(tmpbuf,"SPO2:");
	LCD_MeasureUniString(tmpbuf, &w, &h);
	LCD_Fill(PPG_DATA_SHOW_X+PPG_DATA_SHOW_W/2+w, PPG_DATA_SHOW_Y, 50, PPG_DATA_SHOW_H, BLACK);
	sprintf(strbuf, "%d", g_spo2);
	mmi_asc_to_ucs2(tmpbuf,strbuf);
	LCD_ShowUniString(PPG_DATA_SHOW_X+PPG_DATA_SHOW_W/2+w, PPG_DATA_SHOW_Y, tmpbuf);

#else
#ifdef CONFIG_PPG_SUPPORT
	LCD_MeasureString("HR:", &w, &h);		
	LCD_Fill(PPG_DATA_SHOW_X+w, PPG_DATA_SHOW_Y, 50, PPG_DATA_SHOW_H, BLACK);
	sprintf(strbuf, "%d", g_hr);
	LCD_ShowString(PPG_DATA_SHOW_X+w, PPG_DATA_SHOW_Y, strbuf);

	LCD_MeasureString("SPO2:", &w, &h);
	LCD_Fill(PPG_DATA_SHOW_X+PPG_DATA_SHOW_W/2+w, PPG_DATA_SHOW_Y, 50, PPG_DATA_SHOW_H, BLACK);
	sprintf(strbuf, "%d", g_spo2);
	LCD_ShowString(PPG_DATA_SHOW_X+PPG_DATA_SHOW_W/2+w, PPG_DATA_SHOW_Y, strbuf);
#endif	
#endif
}

