duxinglang-1/nRF9160_test/E2_TEST/src/screen/screen.c
	case SCREEN_ACTION_UPDATE:
		PowerOffUpdateStatus();
		break;
	}
	
	scr_msg[SCREEN_ID_POWEROFF].act = SCREEN_ACTION_NO;
}

void FindDeviceScreenProcess(void)
{
	u16_t rect_x,rect_y,rect_w=180,rect_h=80;
	u16_t x,y,w,h;
	u8_t notify[128] = "Find Device!";

	switch(scr_msg[SCREEN_ID_FIND_DEVICE].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_FIND_DEVICE].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_FIND_DEVICE].status = SCREEN_STATUS_CREATED;
				
		rect_x = (LCD_WIDTH-rect_w)/2;
		rect_y = (LCD_HEIGHT-rect_h)/2;
		
		LCD_DrawRectangle(rect_x, rect_y, rect_w, rect_h);
		LCD_Fill(rect_x+1, rect_y+1, rect_w-2, rect_h-2, BLACK);
		
	#ifdef FONT_24
		LCD_SetFontSize(FONT_SIZE_24);
	#else
		LCD_SetFontSize(FONT_SIZE_16);
	#endif
		LCD_MeasureString(notify,&w,&h);
		x = (w > rect_w)? 0 : (rect_w-w)/2;
		y = (h > rect_h)? 0 : (rect_h-h)/2;
		x += rect_x;
		y += rect_y;
		LCD_ShowString(x,y,notify);
		break;
		
	case SCREEN_ACTION_UPDATE:
		break;
	}
	
	scr_msg[SCREEN_ID_FIND_DEVICE].act = SCREEN_ACTION_NO;
}

#ifdef CONFIG_SYNC_SUPPORT
void ExitSyncDataScreen(void)
{
	SyncDataStop();
	EnterIdleScreen();
}

void EnterSyncDataScreen(void)
{
	if(screen_id == SCREEN_ID_SYNC)
		return;

	history_screen_id = screen_id;
	scr_msg[history_screen_id].act = SCREEN_ACTION_NO;
	scr_msg[history_screen_id].status = SCREEN_STATUS_NO;

	screen_id = SCREEN_ID_SYNC;
	scr_msg[SCREEN_ID_SYNC].act = SCREEN_ACTION_ENTER;
	scr_msg[SCREEN_ID_SYNC].status = SCREEN_STATUS_CREATING;

#ifdef CONFIG_ANIMATION_SUPPORT	
	AnimaStopShow();
#endif
	k_timer_stop(&mainmenu_timer);
	k_timer_start(&mainmenu_timer, K_SECONDS(3), NULL);

#ifdef CONFIG_FOTA_DOWNLOAD
	SetLeftKeyUpHandler(fota_start);
#elif defined(CONFIG_DATA_DOWNLOAD_SUPPORT)
  #ifdef CONFIG_IMG_DATA_UPDATE
	SetLeftKeyUpHandler(dl_img_start);
	SetRightKeyUpHandler(dl_img_exit);
  #elif defined(CONFIG_FONT_DATA_UPDATE)
	SetLeftKeyUpHandler(dl_font_start);
	SetRightKeyUpHandler(dl_font_exit);
  #elif defined(CONFIG_PPG_DATA_UPDATE)
	SetLeftKeyUpHandler(dl_ppg_start);
	SetRightKeyUpHandler(dl_ppg_exit);
  #endif
#else
	SetLeftKeyUpHandler(EnterPoweroffScreen);
#endif
	SetRightKeyUpHandler(ExitSyncDataScreen);
}

void SyncUpdateStatus(void)
{
	unsigned char *img_anima[4] = {IMG_RUNNING_ANI_1_ADDR, IMG_RUNNING_ANI_2_ADDR, IMG_RUNNING_ANI_3_ADDR, IMG_RUNNING_ANI_4_ADDR};
	
	switch(sync_state)
	{
	case SYNC_STATUS_IDLE:
		break;

	case SYNC_STATUS_LINKING:
	#ifdef CONFIG_ANIMATION_SUPPORT
		AnimaShow(SYNC_RUNNING_ANI_X, SYNC_RUNNING_ANI_Y, img_anima, ARRAY_SIZE(img_anima), 500, true, NULL);
	#endif
		break;
		
	case SYNC_STATUS_SENT:
	#ifdef CONFIG_ANIMATION_SUPPORT 
		AnimaStopShow();
	#endif
	
		LCD_ShowImg_From_Flash(SYNC_ICON_X, SYNC_ICON_Y, IMG_SYNC_FINISH_ADDR);
		//LCD_ShowImg_From_Flash(SYNC_STR_X, SYNC_STR_Y, IMG_SYNC_STR_ADDR);
		LCD_ShowImg_From_Flash(SYNC_RUNNING_ANI_X, SYNC_RUNNING_ANI_Y, IMG_RUNNING_ANI_4_ADDR);

		SetLeftKeyUpHandler(ExitSyncDataScreen);
		break;
		
	case SYNC_STATUS_FAIL:
	#ifdef CONFIG_ANIMATION_SUPPORT 
		AnimaStopShow();
	#endif
	
		LCD_ShowImg_From_Flash(SYNC_ICON_X, SYNC_ICON_Y, IMG_SYNC_ERR_ADDR);
		//LCD_ShowImg_From_Flash(SYNC_STR_X, SYNC_STR_Y, IMG_SYNC_STR_ADDR);
		LCD_ShowImg_From_Flash(SYNC_RUNNING_ANI_X, SYNC_RUNNING_ANI_Y, IMG_RUNNING_ANI_4_ADDR);

		SetLeftKeyUpHandler(ExitSyncDataScreen);
		break;
	}
}

void SyncShowStatus(void)
{
	LCD_Clear(BLACK);

	LCD_ShowImg_From_Flash(SYNC_ICON_X, SYNC_ICON_Y, IMG_SYNC_LOGO_ADDR);
	//LCD_ShowImg_From_Flash(SYNC_STR_X, SYNC_STR_Y, IMG_SYNC_STR_ADDR);
	LCD_ShowImg_From_Flash(SYNC_RUNNING_ANI_X, SYNC_RUNNING_ANI_Y, IMG_RUNNING_ANI_4_ADDR);
}

void SyncScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_SYNC].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_SYNC].status = SCREEN_STATUS_CREATED;

		SyncShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		if(scr_msg[SCREEN_ID_SYNC].para&SCREEN_EVENT_UPDATE_SYNC)
			scr_msg[SCREEN_ID_SYNC].para &= (~SCREEN_EVENT_UPDATE_SYNC);

		SyncUpdateStatus();
		break;
	}

	scr_msg[SCREEN_ID_SYNC].act = SCREEN_ACTION_NO;
}
#endif/*CONFIG_SYNC_SUPPORT*/

#ifdef CONFIG_TEMP_SUPPORT
void TempUpdateStatus(void)
{
	static u8_t index = 0;
	u16_t x,y,w,h;
	u8_t tmpbuf[64] = {0};
	u32_t img_addr[4] = {IMG_RUNNING_ANI_1_ADDR, IMG_RUNNING_ANI_2_ADDR, IMG_RUNNING_ANI_3_ADDR, IMG_RUNNING_ANI_4_ADDR};

#ifdef CONFIG_ANIMATION_SUPPORT
	if(TempIsWorking())
	{
		index++;
		if(index >= 4)
			index = 0;
		LCD_ShowImg_From_Flash(TEMP_RUNNING_ANI_X, TEMP_RUNNING_ANI_Y, img_addr[index]);
	}
	else
	{
		AnimaStop();
		index = 0;
	}
#endif

	LCD_SetFontSize(FONT_SIZE_24);
	sprintf(tmpbuf, "%d.%d", (u16_t)(g_temp_skin*10)/10, (u16_t)(g_temp_skin*10)%10);
	LCD_MeasureString(tmpbuf, &w, &h);
	x = TEMP_SKIN_UNIT_X-w-2;
	y = TEMP_SKIN_NUM_Y+(TEMP_SKIN_NUM_H-h)/2;
	LCD_Fill(TEMP_SKIN_NUM_X, TEMP_SKIN_NUM_Y, TEMP_SKIN_NUM_W, TEMP_SKIN_NUM_H, BLACK);
	LCD_ShowString(x,y,tmpbuf);

	sprintf(tmpbuf, "%d.%d", (u16_t)(g_temp_body*10)/10, (u16_t)(g_temp_body*10)%10);
	LCD_MeasureString(tmpbuf, &w, &h);
	x = TEMP_BODY_UNIT_X-w-2;
	y = TEMP_BODY_NUM_Y+(TEMP_BODY_NUM_H-h)/2;
	LCD_Fill(TEMP_BODY_NUM_X, TEMP_BODY_NUM_Y, TEMP_BODY_NUM_W, TEMP_BODY_NUM_H, BLACK);
	LCD_ShowString(x,y,tmpbuf);
}

void TempShowStatus(void)
{
	u16_t x,y,w,h;
	u8_t tmpbuf[64] = {0};

	LCD_Clear(BLACK);
	
	LCD_ShowImg_From_Flash(TEMP_ICON_X, TEMP_ICON_Y, IMG_TEMP_ICON_C_ADDR);
	LCD_ShowImg_From_Flash(TEMP_SKIN_ICON_X, TEMP_SKIN_ICON_Y, IMG_TEMP_SKIN_ADDR);
	LCD_ShowImg_From_Flash(TEMP_SKIN_UNIT_X, TEMP_SKIN_UNIT_Y, IMG_TEMP_UNIT_C_ADDR);
	LCD_ShowImg_From_Flash(TEMP_BODY_ICON_X, TEMP_BODY_ICON_Y, IMG_TEMP_BODY_ADDR);
	LCD_ShowImg_From_Flash(TEMP_BODY_UNIT_X, TEMP_BODY_UNIT_Y, IMG_TEMP_UNIT_C_ADDR);
	LCD_ShowImg_From_Flash(TEMP_RUNNING_ANI_X, TEMP_RUNNING_ANI_Y, IMG_RUNNING_ANI_4_ADDR);

	LCD_SetFontSize(FONT_SIZE_24);
	sprintf(tmpbuf, "%d.%d", (u16_t)(g_temp_skin*10)/10, (u16_t)(g_temp_skin*10)%10);
	LCD_MeasureString(tmpbuf, &w, &h);
	x = TEMP_SKIN_UNIT_X-w-2;
	y = TEMP_SKIN_NUM_Y+(TEMP_SKIN_NUM_H-h)/2;
	LCD_ShowString(x,y,tmpbuf);

	sprintf(tmpbuf, "%d.%d", (u16_t)(g_temp_body*10)/10, (u16_t)(g_temp_body*10)%10);
	LCD_MeasureString(tmpbuf, &w, &h);
	x = TEMP_BODY_UNIT_X-w-2;
	y = TEMP_BODY_NUM_Y+(TEMP_BODY_NUM_H-h)/2;
	LCD_ShowString(x,y,tmpbuf);
}

void TempScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_TEMP].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_TEMP].status = SCREEN_STATUS_CREATED;
		TempShowStatus();
		break;
		
